src/cf/InformationRegisters/АдресаДоставкиЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АдресаДоставкиЭПД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчастникЭДО</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО_ЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/АдресаДоставкиЭПД/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере()
	
	УчастникЭДОИзПараметров = Неопределено;
	Если Параметры.Свойство("УчастникЭДО", УчастникЭДОИзПараметров) Тогда
		Запись.УчастникЭДО = УчастникЭДОИзПараметров;
	КонецЕсли;
	
	СтруктураАдреса = Неопределено;
	Параметры.Свойство("СтруктураАдреса", СтруктураАдреса);
	Если СтруктураАдреса <> Неопределено Тогда
		СтруктураАдреса.Свойство("Значение", Запись.Адрес);
		СтруктураАдреса.Свойство("Представление", Запись.ПредставлениеАдреса);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ПредставлениеАдреса) = Ложь Тогда
		Запись.ПредставлениеАдреса = ОбменСГИСЭПД.ПредставлениеКонтактнойИнформации(Запись.Адрес);
	КонецЕсли;
	
КонецПроцедуры
